#+NAME: Justin's Time Log
#+AUTHOR: Justin Southworth
#+DATE: Spring 2014
#+STARTUP: content indent logdrawer lognoteclock-out lognotedone
#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00


* Pre week 1 (2-18)
** Learning how to make this org stuff work
  CLOCK: [2014-02-16 Sun 21:52]--[2014-02-17 Mon 01:12] =>  3:20
** Didn't clock correctly because of machine crashes. Which were due to having no space on my X-drive.
** DONE Reviewing org mode commands
   CLOSED: [2014-02-18 Tue 15:22]
   - CLOSING NOTE [2014-02-18 Tue 15:22] \\
     Probably will still need some work, but good enough for now.


* Week 1 take 2 (2/18 - 2/25)
:LOGBOOK:
  CLOCK: [2014-02-18 Tue 15:52]--[2014-02-18 Tue 15:53] =>  0:01
  * DONE Correcting and editing org file                   :class:tuesday:org:
CLOSED: [2014-02-19 Wed 12:19]
- State "DONE"       from "TODO"       [2014-02-19 Wed 12:19]
  CLOCK: [2014-02-18 Tue 14:38]--[2014-02-18 Tue 15:52] =>  1:14
  - Class
:PROPERTIES:
:ORDERED: t
:END:

** DONE Test TODO
CLOSED: [2014-02-19 Wed 12:01]
- State "DONE"       from "TODO"       [2014-02-19 Wed 12:01]

:PROPERTIES:
:ORDERED: t
:END:

- CLOSING NOTE [2014-02-18 Tue 15:50] \\
  take 3?

- CLOSING NOTE [2014-02-18 Tue 15:48] \\
  In progress??

   - CLOSING NOTE [2014-02-18 Tue 15:48] \\
     started wor
** DONE Fix org mode based on Nurk's email                 :wednesday:org:
CLOSED: [2014-02-19 Wed 15:11]
- State "DONE"       from "TODO"       [2014-02-19 Wed 15:11]
CLOCK: [2014-02-19 Wed 14:58]--[2014-02-19 Wed 15:11] =>  0:13

CLOCK: [2014-02-19 Wed 12:17]--[2014-02-19 Wed 12:18] =>  0:01
- Does a logbook exist?
CLOCK: [2014-02-19 Wed 12:04]--[2014-02-19 Wed 12:17] =>  0:13
- Updated emacs to get Nurk's package manager. This is a test to see if it worked.
CLOCK: [2014-02-19 Wed 12:03]--[2014-02-19 Wed 12:04] =>  0:01
- State "TODO"       from "IN_PROGRESS" [2014-02-19 Wed 12:01]


** DONE Class
CLOSED: [2014-02-24 Mon 15:06]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:06]
CLOCK: [2014-02-20 Thu 14:49]--[2014-02-20 Thu 15:51] =>  1:02
- Classtime.
CLOCK: [2014-02-20 Thu 14:42]--[2014-02-20 Thu 14:42] =>  0:00
:END:
** DONE Attempting to clean this file
CLOSED: [2014-02-19 Wed 15:25]
- State "DONE"       from ""           [2014-02-19 Wed 15:25]
CLOCK: [2014-02-19 Wed 15:12]--[2014-02-19 Wed 15:22] =>  0:10
- Can't fix the problem where the clocks and following messages are not indented well.
  That's just gonna be a mess to read. Did find how to further indent each line so
  that it looks a bit cleaner. Logbook still not showing up.

** DONE Back onto Logbook
CLOSED: [2014-02-24 Mon 15:11]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:11]
CLOCK: [2014-02-19 Wed 22:02]--[2014-02-19 Wed 22:02] =>  0:00
- Test.
CLOCK: [2014-02-19 Wed 21:47]--[2014-02-19 Wed 21:48] =>  0:01
:END:
CLOCK: [2014-02-19 Wed 17:53]--

CLOCK: [2014-02-19 Wed 16:24]--[2014-02-19 Wed 16:24] =>  0:00
- Nurk couldn't figure it out either, so I'm off of that for now.
CLOCK: [2014-02-19 Wed 15:51]--
CLOCK: [2014-02-19 Wed 15:24]--[2014-02-19 Wed 15:51] =>  0:27
:PROPERTIES:
:Effort:   0:30
:END:

** DONE Foo
CLOSED: [2014-02-19 Wed 18:02]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-19 Wed 18:02]
- State "IN_PROGRESS" from "DONE"       [2014-02-19 Wed 18:01] \\
  Stuff.
:END:
- State "DONE"       from "TODO"       [2014-02-19 Wed 17:28]
CLOCK: [2014-02-19 Wed 16:23]--[2014-02-19 Wed 16:23] =>  0:00
CLOCK: [2014-02-19 Wed 16:21]--[2014-02-19 Wed 16:23] =>  0:02
CLOCK: [2014-02-19 Wed 15:53]--

** DONE Prepping for the weekend
CLOCK: [2014-02-19 Wed 21:13]--[2014-02-19 Wed 21:19] =>  0:06
- On to checking if I can get the logbook to work.



** DONE Logbook on mac
CLOSED: [2014-02-24 Mon 15:14]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:14]
CLOCK: [2014-02-19 Wed 22:32]--[2014-02-19 Wed 22:42] =>  0:10
- Test...
CLOCK: [2014-02-19 Wed 22:03]--[2014-02-19 Wed 22:09] =>  0:06
- Broke
CLOCK: [2014-02-19 Wed 21:48]--[2014-02-19 Wed 22:01] =>  0:13
CLOCK: [2014-02-19 Wed 21:48]--[2014-02-19 Wed 21:48] =>  0:00
- Working..
:END:
CLOCK: [2014-02-19 Wed 21:40]--[2014-02-19 Wed 21:47] =>  0:07
- Maybe it worked this time???
CLOCK: [2014-02-19 Wed 21:20]--[2014-02-19 Wed 21:40] =>  0:20
- Switched computers.

** DONE Learning more emacs
CLOSED: [2014-02-24 Mon 15:14]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:14]
:END:
CLOCK: [2014-02-19 Wed 22:02]--[2014-02-19 Wed 22:03] =>  0:01
- Test failed... It's something in my .emacs file?
CLOCK: [2014-02-19 Wed 16:25]--[2014-02-19 Wed 17:28] =>  1:03
- Progress. Found some good pages of info.



** DONE New Test... The other broke?                                :test:
CLOSED: [2014-02-24 Mon 15:04]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-24 Mon 15:04]
- State "IN_PROGRESS" from "TODO"       [2014-02-24 Mon 15:03] \\
  Started.
CLOCK: [2014-02-19 Wed 22:26]--[2014-02-19 Wed 22:32] =>  0:06
- Test.
CLOCK: [2014-02-19 Wed 22:21]--[2014-02-19 Wed 22:26] =>  0:05
- More testing...
:END:

** DONE Test                                                        :test:
CLOSED: [2014-02-24 Mon 15:04]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:04]
CLOCK: [2014-02-19 Wed 22:17]--[2014-02-19 Wed 22:21] =>  0:04
- Broke the todo and can't seem to fix it..
CLOCK: [2014-02-19 Wed 22:16]--[2014-02-19 Wed 22:17] =>  0:01
- See?
:END:
CLOCK: [2014-02-19 Wed 22:09]--[2014-02-19 Wed 22:16] =>  0:07
- Commenting out the (require 'org) from my .emacs solved the problem...


** DONE Test 10000                                                  :test:
CLOSED: [2014-02-24 Mon 15:04]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 15:04]
:END:
CLOCK: [2014-02-19 Wed 22:42]--[2014-02-20 Thu 00:22] =>  1:40
- Clocking in and out started failng.



** DONE Dictionary list page
CLOSED: [2014-02-27 Thu 15:05]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-27 Thu 15:05]
CLOCK: [2014-02-24 Mon 16:45]--[2014-02-24 Mon 18:03] =>  1:18
- Got the page working. Need some seeds in the db now.
- State "TODO"       from "IN_PROGRESS" [2014-02-24 Mon 15:15]
CLOCK: [2014-02-24 Mon 14:56]--[2014-02-24 Mon 16:37] =>  1:41
:PROPERTIES:
:Effort:   2:00
:END:
- Caught bad error again where the vb freezes up. Waited a while and it came back though.
:END:

** DONE Survey CRUD page
CLOSED: [2014-02-27 Thu 15:05]
:LOGBOOK:
- State "DONE"       from "IN_PROGRESS" [2014-02-27 Thu 15:05]
CLOCK: [2014-02-24 Mon 21:12]--[2014-02-24 Mon 23:04] =>  1:52
- Got everything started up. These messages feel like they're the same as my commit messages...
:END:

** DONE Enabling ssh into vb
CLOSED: [2014-02-24 Mon 16:45]
:LOGBOOK:
- State "DONE"       from "TODO"       [2014-02-24 Mon 16:45]
CLOCK: [2014-02-24 Mon 16:37]--[2014-02-24 Mon 16:45] =>  0:08
:END:



* Week 2
** DONE Code Review                                                :class:
CLOSED: [2014-02-27 Thu 15:02]
:LOGBOOK:
- CLOSING NOTE [2014-02-27 Thu 15:02] \\
  Went well.
CLOCK: [2014-02-25 Tue 13:58]--[2014-02-25 Tue 15:48] =>  1:50
- Everyone fails. False.
:END:
** DONE Thursday                                                      :class:
CLOSED: [2014-02-27 Thu 15:04]
:LOGBOOK:
CLOCK: [2014-02-27 Thu 13:58]--[2014-02-27 Thu 15:03] =>  1:05
- Talked about nginx and other servers.
:END:

** DONE Learning about Django tests                         :class:django:
CLOSED: [2014-03-12 Wed 22:30]
:LOGBOOK:
CLOCK: [2014-03-02 Sun 15:49]--[2014-03-02 Sun 16:51] =>  1:02
- Switching over..
- State "IN_PROGRESS" from "TODO"       [2014-02-27 Thu 15:54] \\
  Doin stuff..
CLOCK: [2014-02-27 Thu 15:03]--[2014-02-27 Thu 15:53] =>  0:50
- Started learning about Django testing.
:END:
** DONE Learning the template system                              :django:
CLOSED: [2014-03-12 Wed 22:30]
:LOGBOOK:
- CLOSING NOTE [2014-03-12 Wed 22:30]
CLOCK: [2014-03-02 Sun 19:48]--[2014-03-02 Sun 21:28] =>  1:40
- Read a lot of stuff. Commented in a few things for later.
CLOCK: [2014-03-02 Sun 16:51]--[2014-03-02 Sun 18:16] =>  1:25
- Read through Django's documentation.
:END:

* Week 3
** DONE Tuesday                                                    :class:
CLOSED: [2014-03-11 Tue 13:59]
:LOGBOOK:
- CLOSING NOTE [2014-03-11 Tue 13:59] \\
  Class be over.
CLOCK: [2014-03-04 Tue 14:03]--[2014-03-04 Tue 16:00] =>  1:57
- Got lots of stuff done. Meeting in here at 9 tonight if free.
:END:
** DONE Thursday                                                   :class:
CLOSED: [2014-03-11 Tue 14:00]
:LOGBOOK:
CLOCK: [2014-03-06 Thu 13:50]--[2014-03-06 Thu 15:56] =>  2:06
- Git craziness. Done with first iteration.
:END:
** DONE Read In the Beginning...
CLOSED: [2014-03-11 Tue 14:00]
:LOGBOOK:
- CLOSING NOTE [2014-03-11 Tue 14:00]
CLOCK: [2014-03-10 Mon 14:56]--[2014-03-10 Mon 17:45] =>  2:49
- Good stuff.
:END:
* Week 4
** DONE Tuesday                                                    :class:
CLOSED: [2014-03-12 Wed 22:30]
:LOGBOOK:
- CLOSING NOTE [2014-03-12 Wed 22:30]
CLOCK: [2014-03-11 Tue 13:59]--[2014-03-11 Tue 15:48] =>  1:49
- Ryan ___ from Aon.
:END:
** DONE Organizing
CLOSED: [2014-03-12 Wed 23:25]
:LOGBOOK:
CLOCK: [2014-03-12 Wed 22:30]--[2014-03-12 Wed 22:46] =>  0:16
- Just figuring out where things are at.
:END:
** DONE Mas emacsing                                                  :emacs:
CLOSED: [2014-03-12 Wed 23:25]
:LOGBOOK:
CLOCK: [2014-03-12 Wed 22:46]--[2014-03-12 Wed 23:25] =>  0:39
- Added auto indenting and some other stuff.
:END:
** DONE Writing dictionary tests
CLOSED: [2014-04-16 Wed 21:41]
:LOGBOOK:
CLOCK: [2014-03-13 Thu 10:05]--[2014-03-13 Thu 11:14] =>  1:09
- Solved the dictionary delete test, and fixed indentation errors I made.
CLOCK: [2014-03-12 Wed 23:22]--[2014-03-13 Thu 00:17] =>  0:55
- Getting somewhere. Stopped at delete for bed.
:END:
** DONE Ask what the red light switch does
CLOSED: [2014-04-01 Tue 13:52]
:LOGBOOK:
- CLOSING NOTE [2014-04-01 Tue 13:52] \\
  It's just another light switch.
:END:
** DONE Thursday                                                   :class:
CLOSED: [2014-03-14 Fri 23:15]
:LOGBOOK:
- CLOSING NOTE [2014-03-14 Fri 23:15] \\
  Database stuff.
CLOCK: [2014-03-13 Thu 13:54]--[2014-03-13 Thu 15:59] =>  2:05
- Did stuff with south. Figured out what to do next
:END:
** DONE Tests and standardization
CLOSED: [2014-04-16 Wed 22:19]
:LOGBOOK:
- CLOSING NOTE [2014-04-16 Wed 22:19] \\
  Cause why not?
CLOCK: [2014-03-15 Sat 14:41]--[2014-03-15 Sat 18:05] =>  3:24
- Made some good progress. Still need a standard way of doing urls...
CLOCK: [2014-03-15 Sat 13:36]--[2014-03-15 Sat 13:50] =>  0:14
- Started, but ran out of space on my vb. Trying to fix it...
CLOCK: [2014-03-14 Fri 23:01]--[2014-03-14 Fri 23:49] =>  0:48
- Read best practices stuff
:END:
** DONE Look at using fixtures for "FactoryGirl"                 :testing:
CLOSED: [2014-04-15 Tue 23:25]
:LOGBOOK:
- CLOSING NOTE [2014-04-15 Tue 23:25] \\
  Doing it.
:END:
*** [[http://toastdriven.com/blog/2011/apr/10/guide-to-testing-in-django/][Testing guide]]
*** [[https://github.com/rbarrois/factory_boy][Factory boy]]
*** Coverage

Done at 6:00

** DONE VB troubles. Out of disk space.
CLOSED: [2014-03-15 Sat 14:42]
:LOGBOOK:
- CLOSING NOTE [2014-03-15 Sat 14:42] \\
  Working well enough.
CLOCK: [2014-03-15 Sat 13:50]--[2014-03-15 Sat 14:41] =>  0:51
- Removed enough stuff for now, but it'll happen again at some point.
:END:

** DONE Long term solution for space
CLOSED: [2014-04-01 Tue 13:51]
:LOGBOOK:
- CLOSING NOTE [2014-04-01 Tue 13:51] \\
  Increased storage by making a new box.
:END:

* Week 5
** DONE Tuesday                                                    :class:
CLOSED: [2014-03-19 Wed 23:25]
:LOGBOOK:
CLOCK: [2014-03-18 Tue 14:01]--[2014-03-18 Tue 15:54] =>  1:53
- Trying to deal with space issues. Can't have snapshots and change size.
:END:
** DONE Fix virtual box. Need to make a new one, I think... :(
CLOSED: [2014-03-19 Wed 23:25]
:LOGBOOK:
CLOCK: [2014-03-19 Wed 19:25]--[2014-03-19 Wed 23:23] =>  3:58
- Tried to salvage it, but didn't work. New one seems to be good...
CLOCK: [2014-03-18 Tue 16:55]--[2014-03-18 Tue 17:17] =>  0:22
- VirtualBox crashed again when trying to merge. Not good
:END:
** DONE Thursday                                                   :class:
CLOSED: [2014-03-20 Thu 15:57]
:LOGBOOK:
- CLOSING NOTE [2014-03-20 Thu 15:57] \\
  Learned Django Rest stuff
CLOCK: [2014-03-20 Thu 14:00]--[2014-03-20 Thu 15:57] =>  1:57
:END:
* Week 6
** DONE Tuesday                                                    :class:
CLOSED: [2014-04-03 Thu 13:44]
:LOGBOOK:
- CLOSING NOTE [2014-04-03 Thu 13:44] \\
  Did that class
CLOCK: [2014-04-01 Tue 13:51]--[2014-04-01 Tue 15:54] =>  2:03
- Worked on some testing things.
:END:
** DONE Thursday                                                   :class:
CLOSED: [2014-04-03 Thu 15:53]
:LOGBOOK:
- CLOSING NOTE [2014-04-03 Thu 15:53]
CLOCK: [2014-04-03 Thu 13:44]--[2014-04-03 Thu 15:53] =>  2:09
- Got factory_boy started.
:END:
* Week 7
** DONE Tuesday                                                    :class:
CLOSED: [2014-04-08 Tue 22:28]
:LOGBOOK:
- CLOSING NOTE [2014-04-08 Tue 22:28]
CLOCK: [2014-04-08 Tue 13:52]--[2014-04-08 Tue 15:54] =>  2:02
- Code review. Some Factory-Boy
:END:
** DONE Customizing
CLOSED: [2014-04-08 Tue 22:39]
:LOGBOOK:
- CLOSING NOTE [2014-04-08 Tue 22:39] \\
  Did it.
CLOCK: [2014-04-08 Tue 18:27]--[2014-04-08 Tue 22:39] =>  4:12
- Working..
:END:
** DONE Factory-boy
CLOSED: [2014-04-08 Tue 23:40]
:LOGBOOK:
- CLOSING NOTE [2014-04-08 Tue 23:40] \\
  Finished it.
CLOCK: [2014-04-08 Tue 22:39]--[2014-04-08 Tue 23:40] =>  1:01
:END:
** DONE Thursday                                                     :class:
CLOSED: [2014-04-10 Thu 17:06]
:LOGBOOK:
CLOCK: [2014-04-10 Thu 13:54]--[2014-04-10 Thu 15:56] =>  2:02
- Looking at Capybara replacements... Project tests.
:END:
** DONE Mas tests
CLOSED: [2014-04-15 Tue 23:25]
:LOGBOOK:
CLOCK: [2014-04-10 Thu 17:06]--[2014-04-10 Thu 17:57] =>  0:51
- Got a couple project tests going.
:END:
** DONE Read Atlassian Git workflow tutorial
CLOSED: [2014-04-12 Sat 01:54]
:LOGBOOK:
CLOCK: [2014-04-11 Fri 23:58]--[2014-04-12 Sat 01:54] =>  1:56
- Read through the tutorial and pull request stuff, as well as some other Git things I didn't know.
:END:
* Week 8
** DONE Tuesday                                                       :class:
CLOSED: [2014-04-15 Tue 15:55]
:LOGBOOK:
CLOCK: [2014-04-15 Tue 14:01]--[2014-04-15 Tue 15:54] =>  1:53
- Class Tuesday
:END:
** DONE Project Tests
CLOSED: [2014-04-15 Tue 23:25]
:LOGBOOK:
CLOCK: [2014-04-15 Tue 22:00]--[2014-04-15 Tue 23:24] =>  1:24
- Where: Lab
  Who: None
  What: Project tests (finished)
:END:
** DONE Google Hangouts
CLOSED: [2014-04-16 Wed 21:59]
:LOGBOOK:
CLOCK: [2014-04-16 Wed 21:22]--[2014-04-16 Wed 21:59] =>  0:37
- Apparently Ryan doesn't exist.
CLOCK: [2014-04-16 Wed 15:55]--[2014-04-16 Wed 16:12] =>  0:17
- Still need to get Ryan and John.
:END:
** DONE init files
CLOSED: [2014-04-16 Wed 23:13]
:LOGBOOK:
- CLOSING NOTE [2014-04-16 Wed 23:13] \\
  Found some good stuff, merged everything again. Not easy to keep up with this...
  Who: Me
  Where: Math interaction room
CLOCK: [2014-04-16 Wed 21:59]--[2014-04-16 Wed 23:15] =>  1:16
:END:
*** C-M-i for autocomplete
*** minimap-mode
** DONE Thursday                                                   :class:
CLOSED: [2014-04-26 Sat 14:37]
:LOGBOOK:
CLOCK: [2014-04-17 Thu 13:34]--[2014-04-17 Thu 15:51] =>  2:17
- Realized we were redirecting badly, starting fixing it.
:END:
*** Found incorrect survey add url
*** Add pages redirect to incorrect detail page
* Week 9
** DONE Tuesday                                                    :class:
CLOSED: [2014-04-24 Thu 14:02]
:LOGBOOK:
CLOCK: [2014-04-22 Tue 13:55]--[2014-04-22 Tue 15:51] =>  1:56
- Did testing things. Learned about Rally
:END:
** DONE Fix add pages redirect locations
CLOSED: [2014-05-13 Tue 13:54]
:LOGBOOK:
- CLOSING NOTE [2014-05-13 Tue 13:54] \\
  Others are in charge now..
CLOCK: [2014-04-26 Sat 20:40]--[2014-04-26 Sat 22:55] =>  2:15
- Alone in the lab. Did some dictionary tests. Stuck on having the POST create the object. Gonna wait for Dustin's stuff.
CLOCK: [2014-04-26 Sat 15:11]--[2014-04-26 Sat 17:19] =>  2:08
- Alone in the lab. Added home page tests. Fixed some locations. Corrected urls. Made home page changable by editing ONE location, rather than 2 (or 3?).
CLOCK: [2014-04-26 Sat 14:26]--[2014-04-26 Sat 15:11] =>  0:45
- Finished the redirects. Alone in the lab. Onward to tests.
:END:
** DONE Figuring out Rally
CLOSED: [2014-04-23 Wed 19:48]
:LOGBOOK:
- CLOSING NOTE [2014-04-23 Wed 19:48] \\
  I think I've figured out enough for now... It isn't worth it to learn a lot this late in the semester.
CLOCK: [2014-04-23 Wed 18:11]--[2014-04-23 Wed 19:48] =>  1:37
CLOCK: [2014-04-23 Wed 10:16]--[2014-04-23 Wed 10:47] =>  0:31
:END:
** Thursday                                                           :class:
:LOGBOOK:
CLOCK: [2014-04-24 Thu 13:55]--[2014-04-24 Thu 15:50] =>  1:55
- Worked on Tests and fix_add_redirects. Helped Adam a lot.
:END:

* Week 10
** DONE Tuesday                                                    :class:
CLOSED: [2014-05-01 Thu 14:34]
:LOGBOOK:
CLOCK: [2014-04-29 Tue 13:48]--[2014-04-29 Tue 15:55] =>  2:07
- Testing. Broke my blocked-ness.
:END:
** DONE Thursday                                                   :class:
CLOSED: [2014-05-13 Tue 13:53]
:LOGBOOK:
CLOCK: [2014-05-01 Thu 14:00]--[2014-05-01 Thu 15:57] =>  1:57
- Party, chose Jenkins, helped the new testers some.
:END:
** DONE Codeship Integration
CLOSED: [2014-05-13 Tue 13:53]
:LOGBOOK:
- CLOSING NOTE [2014-05-13 Tue 13:53] \\
  Everything going? Have Slack and Github integration.
CLOCK: [2014-05-02 Fri 23:22]--[2014-05-02 Fri 23:38] =>  0:16
- Confirmed we're doing this one.
:END:
** DONE Jenkins Integration
CLOSED: [2014-05-13 Tue 13:53]
:LOGBOOK:
- CLOSING NOTE [2014-05-13 Tue 13:53] \\
  Cancelled. Codeship is easy.
CLOCK: [2014-05-03 Sat 11:00]--[2014-05-03 Sat 18:47] =>  7:47
- Thought I had Jenkins working... But didn't. Unlikely the plug-in is the issue.
:END:
* Week 11
** DONE Tuesday                                                    :class:
CLOSED: [2014-05-08 Thu 13:18]
:LOGBOOK:
- CLOSING NOTE [2014-05-08 Thu 13:18] \\
  Got Codeship working. Need to give access to others and get Jenkins/Github webhooks working.
CLOCK: [2014-05-06 Tue 13:15]--[2014-05-06 Tue 16:29] =>  3:14
- Set up Rally tasks, got CodeShip working. Learned what I need to do for Jenkins.
:END:
** DONE Thursday
CLOSED: [2014-05-13 Tue 13:53]
:LOGBOOK:
CLOCK: [2014-05-08 Thu 13:13]--[2014-05-08 Thu 16:25] =>  3:12
- Solved the mysterious test problem, went to the Bean to talk w/ Global Engagement people.
:END:
** Look forward to doing some analysis stuff
*** Read documentation
*** Look at WordSurv 6


* Week 12
** IN_PROGRESS Tuesday                                             :class:
:LOGBOOK:
CLOCK: [2014-05-13 Tue 13:52]--[2014-05-13 Tue 16:12] =>  2:20
- Classss
:END:
* Week 13
* Week 14
